Emacs.org
*** Package | org-msg

Allows for markup language when composing email

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-msg)
  (unless (fboundp 'org-msg-mode)
    (autoload #'org-msg-mode "org-msg" nil t))
  (add-hook 'mu4e-compose-pre-hook #'org-msg-mode)
  (with-eval-after-load 'org-msg
    (customize-set-variable 'org-msg-signature (concat "\n\nCordialement/Regards,\n\n*--*\n" mu4e-compose-signature))
    (pg/customize-set-variables
     `((org-msg-options . "html-postamble:nil toc:nil author:nil num:nil \\n:t")
       (org-msg-startup . "indent inlineimages hidestars")
       (org-msg-greeting-fmt . "\nBonjour/Hi %s,\n\n")
       (org-msg-greeting-name-limit . 3)
       (org-message-convert-citation . t)
       (org-msg-default-alternatives . ((new html)
                                        (reply-to-text html)
                                        (reply-to-html html)))
       (org-msg-recipient-names . nil))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; (specification->package "emacs-org-msg")

#+end_src

*** Package | org-roam

Helps with note-taking strategies.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-roam)
  (with-eval-after-load 'org
    (if pg/is-windows
        (straight-use-package 'emacsql-sqlite3))
    (require 'org-roam))
  (with-eval-after-load 'org-roam
    (pg/customize-set-variables
     `((org-roam-node-display-template . ,(concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
       (org-roam-directory . ,(expand-file-name "~/Documents/Notes"))
       (org-roam-capture-templates . (("d" "default" plain
                                       "%?"
                                       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                                                          "#+title: ${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
                                       :unnarrowed t)
                                      ("s" "design" plain
                                       "%?"
                                       :if-new (file+head "IFT-6253/notes/%<%Y%m%d%H%M%S>-${slug}.org"
                                                          "#+title: ift6253-${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
                                       :unnarrowed t)))))
    (org-roam-setup)
    (with-eval-after-load 'general
      (pg/leader-keys
        "on" '(:ignore t :which-key "notes")
        "onl" '(org-roam-buffer-toggle :which-key "links")
        "onf" '(org-roam-node-find :which-key "find/create")
        "oni" '(org-roam-node-insert :which-key "insert/create"))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; (specification->package "emacs-org-roam")

#+end_src

*** Package | org-fragtog

Allows display of latex fragments in org files.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-fragtog)
  (unless (fboundp 'org-fragtog-mode)
    (autoload #'org-fragtog-mode "org-fragtog" nil t))
  (add-hook 'org-mode-hook #'org-fragtog-mode)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; (specification->package "emacs-org-fragtog")

#+end_src

*** Pomodoro timer

Custom pomodoro timer

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (defun pg/timer-setup ()
    "Sets up some parameters for the timer"
    (setq org-clock-sound (expand-file-name "~/Misc/ding.wav")))

  (defun pg/start-timer ()
    "Begins Pomodoro timer with study timer"
    (interactive)
    (pg/timer-setup)
    (pg/study-timer))

  (defun pg/start-with-break-timer ()
    "Begins Pomodoro timer with break timer"
    (interactive)
    (pg/timer-setup)
    (pg/break-timer))

  (defun pg/stop-timer ()
    "Stops the timer"
    (interactive)
    (setq org-clock-sound nil)
    (remove-hook 'org-timer-done-hook #'pg/study-timer)
    (remove-hook 'org-timer-done-hook #'pg/break-timer)
    (org-timer-stop))

  (defun pg/study-timer ()
    "Study timer for 1 hour"
    (add-hook 'org-timer-done-hook #'pg/break-timer)
    (remove-hook 'org-timer-done-hook #'pg/study-timer)
    (setq org-timer-default-timer "1:00:00")
    (setq current-prefix-arg '(4)) ;; Universal argument
    (call-interactively #'org-timer-set-timer))

  (defun pg/break-timer ()
    "Break timer for 15 minutes"
    (add-hook 'org-timer-done-hook #'pg/study-timer)
    (remove-hook 'org-timer-done-hook #'pg/break-timer)
    (setq org-timer-default-timer "15:00")
    (setq current-prefix-arg '(4)) ;; Universal argument
    (call-interactively #'org-timer-set-timer))

  (with-eval-after-load 'general
    (pg/leader-keys
      "ow" '(:ignore t :which-key "pomodoro")
      "owt" '(pg/start-timer :which-key "start")
      "owb" '(pg/start-with-break-timer :which-key "break")
      "ows" '(pg/stop-timer :which-key "stop")
      "owp" '(org-timer-pause-or-continue :which-key "pause")))

#+end_src

*** Org package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-org.el

  (provide 'pg-org)

#+end_src

** Viewers

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-viewers.el

  ;;; pg-viewers.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | doc-view

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-viewers.el

  (unless (fboundp 'doc-view-mode)
    (autoload #'doc-view-mode "doc-view" nil t))
  (add-to-list 'auto-mode-alist '("\\.djvu$" . doc-view-mode))

#+end_src

*** Package | elfeed

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-viewers.el

  (straight-use-package 'elfeed)
  (unless (fboundp 'elfeed)
    (autoload #'elfeed "elfeed" nil t))
  (with-eval-after-load 'elfeed
    (pg/customize-set-variables
     '((elfeed-feeds . ("https://www.gnu.org/software/guile/news/feed.xml"
                        "https://planet.emacslife.com/atom.xml"
                        "https://oneofus.la/have-emacs-will-hack/feed.xml"
                        "http://oremacs.com/atom.xml"
                        "https://updates.orgmode.org/feed/changes"
                        "http://pragmaticemacs.com/feed/"
                        "https://www.reddit.com/r/GUIX.rss"
                        "https://www.reddit.com/r/emacs.rss"
                        "https://www.reddit.com/r/orgmode.rss"
                        "https://blog.tecosaur.com/tmio/rss.xml"))
       (elfeed-search-filter . "@6-months-ago"))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; (specification->package "emacs-elfeed")

#+end_src

*** Package | pdf-tools

Allows for viewing of pdfs.

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-viewers.el

  (unless pg/is-guix-system
    (straight-use-package 'pdf-tools))
  (unless (fboundp 'pdf-view-mode)
    (autoload #'pdf-view-mode "pdf-tools" nil t))
  (add-to-list 'auto-mode-alist '("\\.pdf$" . pdf-view-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  (specification->package "emacs-pdf-tools")

#+end_src

*** Package | djvu

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-viewers.el

  (straight-use-package 'djvu)
  (require 'djvu)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; (specification->package "emacs-djvu")

#+end_src

*** Viewers package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-viewers.el

  (provide 'pg-viewers)

#+end_src

** Bible

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-bible.el

  ;;; pg-bible.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | dtk

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-bible.el

  (straight-use-package 'dtk)
  (unless (fboundp 'dtk)
    (autoload #'dtk "dtk" nil t))
  (add-hook 'dtk-mode-hook #'(lambda ()
                               (setq-local face-remapping-alist
                                           '((default (:height 1.5) variable-pitch)))))
  (with-eval-after-load 'dtk
    (pg/customize-set-variables
     '((dtk-module . "KJV")
       (dtk-module-category . "Biblical Texts")
       (dtk-word-wrap . t)))
    (with-eval-after-load 'evil
      (evil-define-key 'normal 'dtk-mode-map
        (kbd "C-j") #'dtk-forward-verse
        (kbd "C-k") #'dtk-backward-verse
        (kbd "C-f") #'dtk-forward-chapter
        (kbd "C-b") #'dtk-backward-chapter
        "q" #'dtk-quit
        "c" #'dtk-clear-dtk-buffer
        "s" #'dtk-search)))

#+end_src

*** Bible package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-bible.el

  (provide 'pg-bible)

#+end_src

** Finances

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-finance.el

  ;;; pg-finance.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | ledger-mode

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-finance.el

  (straight-use-package 'ledger-mode)
  (unless (fboundp 'ledger-mode)
    (autoload #'ledger-mode "ledger-mode" nil t))
  (add-to-list 'auto-mode-alist '("\\.dat$" . ledger-mode))
  (unless (fboundp 'company-mode)
    (autoload #'company-mode "company" nil t))
  (add-hook 'ledger-mode-hook #'company-mode)
  (with-eval-after-load 'ledger-mode
    (pg/customize-set-variables
     `((ledger-reconcile-default-commodity . "CAD")
       (ledger-binary-path . ,(concat (getenv "GUIX_EXTRA_PROFILES") "/emacs/emacs/bin/ledger"))
       (ledger-clear-whole-transaction . t))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  (specification->package "ledger")
  ;; (specification->package "emacs-ledger-mode")

#+end_src

*** Finances package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-finance.el

  (provide 'pg-finance)

#+end_src

** Social

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-social.el

  ;;; pg-social.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | erc

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-social.el

  (with-eval-after-load 'erc
    (unless (fboundp 'corfu-mode)
      (autoload #'corfu-mode "corfu" nil t))
    (add-hook 'erc-mode-hook #'corfu-mode)
    (pg/customize-set-variables
     '((erc-server . "irc.libera.chat")
       (erc-nick . "phil-gab99")
       (erc-user . "Philippe Gabriel")
       (erc-kill-buffer-on-part . t)
       (erc-auto-query . bury))))

#+end_src

*** Package | slack

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-social.el

  (straight-use-package 'slack)
  (unless (fboundp 'slack-start)
    (autoload #'slack-start "slack" nil t))
  (with-eval-after-load 'slack
    (pg/customize-set-variables
     '((slack-prefer-current-team . t)
       (slack-buffer-emojify . t)))
    (slack-register-team :name "ift6755"
                         :default t
                         :token (pg/lookup-password :host "ift6755.slack.com" :user "philippe.gabriel.1@umontreal.ca")
                         :cookie (pg/lookup-password :host "ift6755.slack.com" :user "philippe.gabriel.1@umontreal.ca^cookie")
                         :subscribed-channels '((general questions random))
                         :modeline-enabled t)
    (with-eval-after-load 'evil
      (evil-define-key 'normal slack-info-mode-map
        ",u" #'slack-room-update-messages)
      (evil-define-key 'normal slack-mode-map
        ",ra" #'slack-message-add-reaction
        ",rr" #'slack-message-remove-reaction
        ",rs" #'slack-message-show-reaction-users
        ",mm" #'slack-message-write-another-buffer
        ",me" #'slack-message-edit
        ",md" #'slack-message-delete))
    (with-eval-after-load 'general
      (pg/leader-keys
        "c" '(:ignore t :which-key "slack")
        "cs" '(slack-start :which-key "start")
        "cc" '(slack-channel-select :which-key "channels")
        "cm" '(slack-im-select :which-key "message")
        "cr" '(slack-message-add-reaction :which-key "react"))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; (specification->package "emacs-slack") ;; Older commit

#+end_src

*** Package | sx

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-social.el

  (straight-use-package 'sx)
  (unless (fboundp 'sx-search)
    (autoload #'sx-search "sx" nil t))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; (specification->package "emacs-sx")

#+end_src

*** Package | telega

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-social.el

;;  (unless (fboundp 'telega)
;;    (autoload #'telega "telega" nil t))
;;  (with-eval-after-load 'telega
;;    (require 'telega-alert)
;;    (require 'telega-dashboard)
;;    (customize-set-variable 'telega-alert-mode 1))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  (first (lookup-inferior-packages inferior "emacs-telega"))
  (first (lookup-inferior-packages inferior "emacs-telega-contrib"))

#+end_src

*** Social package

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-social.el

  (provide 'pg-social)

#+end_src

** Weather

*** Package header

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-weather.el

  ;;; pg-weather.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | wttrin

#+begin_src emacs-lisp :tangle ~/.dotfiles/.emacs.d/lisp/pg-weather.el

  (defun pg/wttrin-fetch-raw-string (query)
    "Get the weather information based on your QUERY."
    (let ((url-user-agent "curl"))
      (add-to-list 'url-request-extra-headers wttrin-default-accept-language)
      (with-current-buffer
          (url-retrieve-synchronously
           (concat "http://wttr.in/" query)
           (lambda (status) (switch-to-buffer (current-buffer))))
        (decode-coding-string (buffer-string) 'utf-8))))

  (straight-use-package 'wttrin)
  (unless (fboundp 'wttrin)
    (autoload #'wttrin "wttrin" nil t))
  (with-eval-after-load 'wttrin
    (fset #'wttrin-fetch-raw-string #'pg/wttrin-fetch-raw-string)
    (pg/customize-set-variables
     '((wttrin-default-cities . ("montreal"))
       (wttrin-default-accept-language . ("Accept-Language" . "en-US")))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; (specification->package "emacs-wttrin")

#+end_src

